if(__Page.appEnv && __Page.appEnv.textLib)
{
	__Page.appEnv.textLib.guidesText={
		Greeting1:"사령관님께서 저희 요새를 지휘하신다니 영광입니다. 요새가 위치한 이 조용한 섬에는 요새 발전을 위한 자원 광물이 많습니다.",
		Greeting2:"우리 요새는 설립된지 얼마되지 않아 기반시설이 부족합니다. 발전을 하려면 많은 자원이 필요합니다. 건설 자원을 얻으려면 일꾼을 통해 금광을 건설해 주세요.",
		BuildGoldMine2:"적합한 금광의 위치를 선택하세요. 새 건물은 다른 건물과 중복 배치할 수 없고, 나무, 돌 등 장애물 위에 건설할 수 없습니다. 위치 선정 후 녹색 확인 버튼을 터치하세요.",
		GemBuildGoldMine1:"건설과 생산에는 시간이 필요합니다. 작전본부의 시공전환기는 일부 공간의 시간을 가속할 수 있습니다. 해당 기능을 사용해 보세요.",
		WarAlert1:"금광 작업을 시작했다니 정말 잘 됐군요! 대량의 자원으로 요새의 발전을 이룰 수 있겠어요! 하지만 위기가 도사린 섬에서는 한순간에 충돌이 발생할 수도…",
		WarAlert2:"하하, 방어력이 없는 어린양을 또 찾았군! 형제들이여, 총을 들고 날 따르라! 좋은 물건은 나에게 가져오라.",
		WarAlert3:"경보! 레이더가 해적 전함 상륙을 발견했다. 곧 습격한다! 방어 공사를 시작해 적의 침범을 막아내자!!",
		BuildCannon3:"사령관님. 정세가 긴박하니 어서 시공 가속을 사용하세요! ",
		WarStart:"형제들이여! 날 따르라!!",
		TrainUnit1:"적들이 포기를 모릅니다. 무인기계가 적 기지 위치를 고정했습니다. 출격해 적들을 소탕해야 합니다! 사령관님, 병영의 훈련 전투부대에서 안내에 따라 결사대원 20명을 훈련시키세요.",
		TrainUnit1_Btn:"결사대원 20명을 누르세요.",
		TrainUnit3_Btn:"시공 가속 활성화",
		TrainUnit4_Btn:"완료",
		TrainUnit5_Btn:"건설 취소",
		Attack1:"사령관님, 병사들이 대기중입니다. 전사들을 이끌고 적의 기지를 파괴하세요.",
		Attack2:"보고합니다. 아군이 적의 외곽방어선을 격파했습니다. 적의 요새를 계속 공격하도록 허락해주세요.",
		Attack2_1:"적 요새 방어에 빈틈이 없어 우리 전투부대의 공격이 어렵습니다. 작전본부에서 엘리트부대를 파견해 병사들의 사기가 높으니 즉시 출격하세요!",
		Attack3:"격전을 치르며 사령관님의 지휘재능에 감탄했습니다! 사령관님의 인솔 하에 저희 요새가 더 많은 승리를 거두길 바랍니다!",
		BuildOilWell1:"병사 훈련에 필요한 자원은 지하 에너지에서 얻습니다. 힘을 키우려면 더 많은 에너지가 필요합니다. 사령관님, 일꾼을 통해 에너지탐사정을 건설하세요.",
		UpgradeTownHall1:"작전본부와 연결된 지휘센터는 요새의 지도자 허브입니다. 요새를 키우려면 지휘센터 레벨업이 필요합니다. 일꾼을 통해 지휘센터를 레벨업하세요.",
		AchvmntView:"자신의 발전을 통해 게임 내 업적을 해제할 수 있습니다. 업적은 무료 다이아몬드와 경험치를 보상으로 줍니다. 또한 게임 내 종적을 기록합니다.",
		InputName1:"모든 준비 완료. 곧 작전본부와 연결됩니다. 이름을 입력하면 당신의 위대한 업적이 온 천하에 알려질 것입니다.",
		GuideEnd1:"곧 인터넷으로 본부와 연결합니다. 원활한 네트워크 환경을 유지해주세요. 첫 연결 시 작전파일을 다운로드해야 합니다. 잠시 기다려 주세요.",
	};
}
