if(window.aisEnv.textLib)
{
	(function()
	{
		var textLib=window.aisEnv.textLib;
		textLib.shopSpecialName={
			shop_1:"五星徽章",
			shop_2:"精英徽章",
			shop_3:"太阳徽章",
			shop_4:"太阳徽章×10",
			shop_5:"钻石熔压器",
			shop_6:"8000000金矿",
			shop_7:"8000000能源",
			shop_8:"10000能量块",
			shop_15:"机甲图纸",
			shop_9:"鬃狼模块",
			shop_10:"剑齿虎模块",
			shop_11:"玄武模块",
			shop_12:"黄金执政官",
			shop_13:"大力神Mk-2",
			shop_14:"黄金大力神",
		};
		textLib.shopSpecialInfo={
			shop_1:"可获得  五星徽章×1",
			shop_2:"可获得  精英徽章×1",
			shop_3:"可获得  太阳徽章×1\n\n该徽章不可被掠夺",
			shop_4:"可获得  太阳徽章×10\n\n该徽章不可被掠夺",
			shop_5:"可获得  钻石熔压器\n\n每24小时产出1颗钻石",
			shop_6:"可获得  800万金矿",
			shop_7:"可获得  800万能源",
			shop_8:"可获得  10000能量块",
			shop_15:"机甲强化30至35级所需材料。",
			shop_9:"可获得  鬃狼模块×1\n\n机甲优先攻击防御类建筑\n机甲每秒伤害+10%",
			shop_10:"可获得  剑齿虎模块×1\n\n机甲每秒伤害+25%",
			shop_11:"可获得  玄武模块×1\n\n机甲优先攻击防御类建筑\n机甲每秒伤害+15%",
			shop_12:"可获得  黄金执政官×1\n\n强力远程机甲攻击组件",
			shop_13:"可获得  大力神Mk-2×1\n\n近战机甲攻击组件",
			shop_14:"可获得  黄金大力神×1\n\n强力近战机甲攻击组件 可跳墙！",
		};
	})();
}
