if(window.aisEnv.textLib)
{
	(function()
	{
		var textLib=window.aisEnv.textLib;
		textLib.unitName={
			UntMarine:"결사대원",
			UntSniper:"저격수",
			UntHacker:"약탈병",
			UntCyber:"폭탄거인",
			UntTNTMac:"이동폭탄병",
			UntChop:"폭탄헬리콥터",
			UntTank:"에너지사냥꾼",
			UntHealer:"간호사",
			UntAvenger:"지옥불",
			UntPEKKA:"패왕기갑",
		};
		textLib.unitInfo={
			UntMarine:"결사대원은 가장 기본적인 전투부대로 산탄총의 사정거리가 짧아 타깃에 접근해야 공격할 수 있습니다. 맹렬한 포화에 맞서는 결사대원은 적을 두렵게 만듭니다.",
			UntSniper:"저격수가 장착한 대물라이플은 사정거리가 길어 원거리 화력 방출이 가능합니다. 벽 방어를 무시하고 적군 건물을 직접 공격합니다.",
			UntHacker:"방독마스크는 그들의 상징입니다. 훈련된 그들의 유일한 목적은 자원약탈입니다. 이동속도가 빠르고 자원 건물에 대한 공격력이 엄청납니다. 습격을 받으면 탄약과 식량이 순식간에 사라집니다.",
			UntCyber:"폭탄거인의 육중한 갑옷은 적군의 화력을 막아냅니다. 적의 참호가 첫 타깃이며 부대의 주요 화력 방출 포인트를 엄호할 수 있습니다.",
			UntTNTMac:"적의 성벽은 공격을 어렵게 합니다. 과학자가 연구제작한 탄약은 적군 성벽 파괴의 사명을 가지고 탄생했습니다. 성벽에게 탄약의 폭파력은 악몽입니다.",
			UntChop:"폭탄헬리콥터는 공중에서 행동합니다. 우선 적의 참호를 공격합니다. 공중에서 지상의 화력과 함정을 피해 폭탄을 투하합니다. 폭탄은 운석처럼 지상 건물을 타격합니다.",
			UntTank:"거대한 연료전지함과 복잡한 광학렌즈를 장착해 전지 내 전기에너지를 치명적인 레이저로 전환합니다. 엄청난 화력을 방출하지만 장갑은 약합니다.",
			UntHealer:"전쟁터의 백의의 천사. 최신 의료 기술로 빠르게 부상을 치유합니다. 지구전에서 꼭 필요한 우수한 병종입니다.",
			UntAvenger:"지옥의 화염. 분노를 토하는 모습은 지옥의 불길이라는 묘사가 딱입니다. 참혹한 화력으로 전쟁터를 분노로 가득 채웁니다.",
			UntPEKKA:"강대한 인간형 기갑 병기입니다. 패왕기갑은 작은 도시를 파괴할 수 있다고 전해집니다.  전쟁의 불길 속에서 빛나던 붉은 눈을 잊지 못할 겁니다.",
		};
	})();
}
