if(window.aisEnv.textLib)
{
	(function()
	{
		var textLib=window.aisEnv.textLib;
		textLib.buffName={
			Shield1D:"투명자기장(1일)",
			Shield3D:"투명자기장(3일)",
			Shield7D:"투명자기장(1주)",
		};
		textLib.buffInfo={
			Shield1D:"투명자기장을 사용하면 공격 위협을 피할 수 있습니다. 보호받는 동안 수색에서 안전합니다. 투명자기장 구매시간은 누적할 수 있습니다. 주의: 다른 플레이어 공격 시 투명자기장 효과가 사라집니다.",
			Shield3D:"투명자기장을 사용하면 공격 위협을 피할 수 있습니다. 보호받는 동안 수색에서 안전합니다. 투명자기장 구매시간은 누적할 수 있습니다. 주의: 다른 플레이어 공격 시 투명자기장 효과가 사라집니다.",
			Shield7D:"투명자기장을 사용하면 공격 위협을 피할 수 있습니다. 보호받는 동안 수색에서 안전합니다. 투명자기장 구매시간은 누적할 수 있습니다. 주의: 다른 플레이어 공격 시 투명자기장 효과가 사라집니다.",
		};
	})();
}
